import pytest

from parse import clean_text_tyzhden


@pytest.mark.parametrize("string, expected", [
    # Make sure to clean the <a> tags inside the text + extract the correct pieces of text
    (
        '''<p>Джон Болтон, колишній радник президента США з національної безпеки за першої каденції Трампа, <a href="https://x.com/AmbJohnBolton/status/1895488126023508204" target="_blank">висловився так:</a> «США з одного боку разом з Росією та Північною Кореєю, в той час як усі наші союзники по НАТО з іншого боку, — це ганьба. Трамп не грає в багатогранні шахи, він просто помиляється».</p>
        <p>Президент Зеленський подякував всім європейським лідерам та висловив <a href="https://kyivindependent.com/zelensky-thanks-us-after-tense-meeting-with-trump/" rel="noopener" target="_blank">окрему подяку</a> США. «Дякую, Америка, дякую за вашу підтримку, дякую за цей візит», – написав президент Зеленський у відповідь на звинувачення у невдячності. «Україна потребує справедливого й тривалого миру, і ми працюємо саме над цим».</p>
        <p>Час та українська стійкість визначать, які наслідки матимуть ці чергові безпрецедентні події.</p>
        </div>''', 
        ['Джон Болтон, колишній радник президента США з національної безпеки за першої каденції Трампа, висловився так: «США з одного боку разом з Росією та Північною Кореєю, в той час як усі наші союзники по НАТО з іншого боку, — це ганьба. Трамп не грає в багатогранні шахи, він просто помиляється».',
         'Президент Зеленський подякував всім європейським лідерам та висловив окрему подяку США. «Дякую, Америка, дякую за вашу підтримку, дякую за цей візит», – написав президент Зеленський у відповідь на звинувачення у невдячності. «Україна потребує справедливого й тривалого миру, і ми працюємо саме над цим».',
         'Час та українська стійкість визначать, які наслідки матимуть ці чергові безпрецедентні події.']
    ),
    # ignore images and their descriptions
    (
        '''<p><img alt="" decoding="async" src="https://i.tyzhden.ua/olskor.jpg" style="width: 700px; height: 849px;"/></p>, <p style="text-align: center;"><em>Гетьманівна Олена Оттт-Скоропадська, 2013 рік. Фото: Ю. Олійник</em></p>''', 
     []
    ),
    # extract subheadings
    (
        '''<strong>Консервативний реалізм</strong>''',
        ['Консервативний реалізм']
    ),
    # but ignore "See also"
    (
        '''<p><strong>Читайте також:&nbsp;<a href="../HISTORY/251840.HTM">У пошуках хліборобів</a></strong></p>''',
        []
    ),
    # extract blockquotes -- TODO, DOESN'T WORK
    # example: this https://tyzhden.ua/mistechko-iak-alternatyva-podilu-na-stolychnist-i-provintsijnist/
    (
        '''<blockquote> <p class="p1"><span class="s1">А потім середній клас зникає з приходом на наші землі Російської імперії, і утворюється розрив між центром і регіоном, що призвело до стагнації, яку ми не можемо подолати досі.</span><i> </i></p>
        </blockquote>''',
        ['А потім середній клас зникає з приходом на наші землі Російської імперії, і утворюється розрив між центром і регіоном, що призвело до стагнації, яку ми не можемо подолати досі.']
    ),
])
def test_clean_text_tyzhden(string, expected):
    assert clean_text_tyzhden(string) == expected


if __name__ == "__main__":  
    pytest.main([__file__])





